#+BEGIN_COMMENT
.. title: bokeh org-mode
.. slug: bokeh-org-mode
.. date: 2018-04-25 21:59:50 UTC-07:00
.. tags: bokeh,org-mode,how-to
.. category: Visualization
.. link: 
.. description: An experiment in getting bokeh working with org-mode.
.. type: text
#+END_COMMENT

** Embedding the Plot
Finally, we need to print out the string that is stored in the =source= variable which then tells org-mode to embed the files into this post. I'll output the full org-block so you can see the header arguments.

#+BEGIN_SRC org
#+BEGIN_SRC python :session bokeh :results output raw :exports results
print('''#+BEGIN_EXPORT html
{}
#+END_EXPORT'''.format(source))
,#+END_SRC
#+END_SRC

#+BEGIN_SRC python :session bokeh :results output raw :exports results
print('''#+BEGIN_EXPORT html
{}
#+END_EXPORT'''.format(source))
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html

<script
    src="test.js"
    id="99045dff-710a-4c8e-8565-6fd31b538349"
    data-bokeh-model-id="f46a6fe0-7aab-47d9-aae0-d14718763236"
    data-bokeh-doc-id="99649b1a-8c14-49b7-a6ef-c61b3ec6dbae"
></script>
#+END_EXPORT

And there you have it. I don't have a lot to say about it, other than that if you hover over the data with your cursor and then look up above at the =ColumnDataSource= above, you'll see that the variables match the inputs

